using HugsLib;
using Verse;

namespace FamiliaMyth.Core
{
    /// <summary>
    /// 模组主类
    /// </summary>
    public class FamiliaMythMod : ModBase
    {
        public static string godName = "你";
        public override string ModIdentifier => "FamiliaMyth";
    }

    /// <summary>
    /// 文本翻译工具类
    /// </summary>
    public static class TranslateHelper
    {
        /// <summary>
        /// 文本翻译工具方法
        /// </summary>
        /// <param name="key">对应的翻译键</param>
        /// <param name="args">替换键值序列</param>
        /// <returns></returns>
        public static TaggedString Translate(string key, params (string, object)[] args)
        {
            String str = key.Translate();
            if (args == null || args.Length == 0)
            {
                return str;
            }

            NamedArgument[] arguments = args.Select(t => new NamedArgument(t.Item2, t.Item1)).ToArray();
            return str.Formatted(arguments);
        }
    }
}

/* Todo List:
 * - [x] 创建恩惠使用的健康状态
 * - [x] 添加Hediff_Pharna代码及def
 * - [x] 添加StatPart_Pharna代码
 * - [x] 添加补丁注入属性修正
 * - [x] 添加神之恩惠仪式
 * - [x] 创建RitualOutComeWorker_GrantPharna代码及def
 * - [x] 创建RitualBehavior_GrantPharna.xml
 * - [x] 创建Precepts_Ritual_Pharna.xml添加PreceptDef和RitualPatternDef
 * - [x] 为两个仪式创建自定义的RitualRole类
 * - [x] 为升华仪式创建同样的代码和xml文件
 * - [x] 添加GameComponent注入仪式
 * - [x] 添加本地化
 * - [x] 测试
 * - [x] 添加经验值获取方式
 * - [x] 添加各属性的监听patch
 * - [x] 添加开发者指令（提高属性，赋予恩惠）
 * - [x] 添加伟业值获取指令
 * - [x] 实现魔力属性注入和成长
 * - [x] 添加升级奖励
 * - [x] 扩展DevelopableAbilityDef
 * - [x] 创建StatPart_DevelopableAbility
 * - [x] 创建基础的发展能力xml（魔导，异常抗性）
 * - [x] 实现基础的技能框架SkillDef
 * - [x] 实现基础的魔法框架SpellDef
 * - [x] 扩展Hediff_Pharna的技能/魔法管理
 * - [x] 完整实现AscendHelper
 * - [x] 实现各个IAscendReward接口
 * - [-] 添加更多升级奖励
 * - [-] 添加更多探索类任务
 * - [ ] 添加更多提示和消息
 * - [ ] 添加本地化
 * - [ ] 试玩，调整数值
 */

/* Develop Log:
 * 02/14 15:31 初步搭建代码框架，StatPart部分开发未完成，Def未创建
 * 02/15 02:54 基本完成恩惠状态的开发，未进行测试；初步设定了恩惠的属性加成，经过表格测试并调整，待实际测试；仪式部分框架完成大半，待继续
 * 02/15 17:11 基本完成0.0.1版本开发，众多bug待修复
 * 02/15 23:06 基本修复了发现的bug，初步测试通过
 * 02/19 02:57 基本完成了经验值的各种获取方式的实现，并添加了开发者指令；初步测试未发现问题，待更多测试，数值待调整
 * 02/25 23:41 完成了基础的发展能力框架，添加了两个基础的发展能力，未测试
 * 02/26 04:08 添加了技能def的基础框架，技能基类和两个基础的技能待实现
 * 02/26 16:40 完成了基本的技能示例框架，余烬技能实现中
 * 02/26 22:32 余烬技能实现中，进行了patch
 * 02/27 03:16 基本完成了余烬的技能，待测试
 * 03/02 01:51 狂化招乱技能已实现，待测试；魔法的基本框架搭建中，咏唱使用的jobdriver待实现
 * 07/26 16:58 基本完成魔法基本框架，升级奖励框架搭建中
 * 07/26 23:06 基本完成升级奖励，添加了一个魔法（诺亚治愈），待更多测试，升级弹窗待润色
 * 07/28 03:06 完成了诺亚治愈和余烬的测试和改进，咏唱词的展示形式待改进，升级奖励的弹窗待改进
 * 07/28 16:39 完成了升级弹窗的改进，修复了咏唱词的bug并调整了颜色
 * 07/28 23:08 任务系统框架基本完成，待测试，细节待完善；修复了Patch存在的bug
 * 07/29 04:22 完成了任务发布及接取的完整逻辑，待测试
 * 07/29 22:57 测试并完成了任务发布及接取，反馈部分待完善
 * 07/30 03:30 继续完善了反馈部分
 * 07/31 03:38 搭建了魔法弹的基类以及多种运动控制器，在魔法基类中预留了接口，实际子类待落实，期待加入更多基于魔法弹的魔法
 * 07/31 17:07 完成了光明之风和风弹子类的实现，材质待添加，效果待测试
 * 08/01 03:27 基本完成了光明之风及其风弹子类的测试和修复，以及材质绘制。特效和机制待调整
 * 08/02 01:23 优化了风弹的材质，修复了一系列风弹相关的bug；期待加入风弹产生时的特效，音效等
 * 08/03 03:12 添加并修复了光明之风的一系列问题；着手制作齐射火标枪，实现并测试了预热阶段的特效，效果待实现
 * 08/03 16:50 完成了齐射火标枪的锁定和射击效果，锁定特效未添加
 * 08/03 21:53 添加并测试了锁定特效
 * 08/04 03:04 添加了齐射火标枪的技能图标，修改了部分机制和特效
 * 08/05 03:35 大幅修改了任务系统，提高了可扩展性，加入了眷族评级等内容，UI部分待添加，待更多测试
 * 08/06 00:22 添加了眷族评级的UI系统，测试并优化完毕
 * 08/07 00:42 完成了意志系统及对应调试指令的添加，基本测试完毕；意志值的增长方式待定
 * 08/07 15:30 添加了意志值的增长方式以及触发时的特效，待更多测试
 * 08/08 16:38 修改了魔导及异常抗性发展能力的效果及能力值增长方式，完善了设计文档
 * 08/10 02:22 添加了技能剑雨滂沱，待测试；特效待添加
 * 08/10 20:57 完成了技能剑雨滂沱，特效已添加，测试通过
 * 08/11 17:22 添加了技能吸引仇恨，在技能基类添加了渲染入口，测试通过
 * 08/13 02:12 完成了技能灵弓光箭，调整了部分魔法的机制
 * 08/13 17:30 添加了咏唱时的魔法阵特效，修改了部分魔法弹的机制，测试通过
 * 08/14 17:07 添加了技能居合拔刀气刃斩，效果基本测试完毕，特效待添加，图标未绘制
 * 08/15 03:56 添加了技能居合拔刀气刃斩的特效，图标未绘制，特效可能需要细化调整
 * 08/15 17:18 完成了技能居合拔刀气刃斩
 * 08/18 03:59 添加了魔法The World，特效待完善，图标未绘制，效果初步测试完毕
 * 08/18 16:55 完成了魔法The World；魔法与原版灵能系统的接轨需要更多考虑
 * 08/19 03:15 添加了恩惠相关的展示用Stat，添加了技能哀兵必胜，加入了属性远程闪避并对Ancot Library进行兼容
 * 08/19 17:13 添加了魔法豪雷积雨云，测试通过；修改了魔法咏唱中断时的行为
 * 08/21 04:19 咏唱词表现形式优化中，着色器待优化，性能问题未考虑
 * 08/21 17:38 着色器还在调试中
 * 08/22 04:18 咏唱词表现形式优化完毕，性能开销未验证
 * 08/24 03:50 重构了咏唱词生成及效果释放部分的逻辑，效果释放部分bug未修复
 * 08/24 15:47 上述的问题已修复
 * 08/24 17:33 魔法君王之剑开发中
 * 08/25 03:57 魔法君王之剑开发中，状态机问题待修复
 * 08/25 16:54 完成了魔法君王之剑，调整了部分魔法弹的运动逻辑
 * 08/26 17:39 修改了部分文本，计划添加爆裂魔法
 * 08/27 03:59 爆裂魔法开发中
 * 08/27 16:34 基本完成，特效部分需要微调
 * 08/27 02:17 完成了爆裂魔法
 * 08/28 18:00 为有持续效果的魔法添加了持续时间的显示；魔法光灵守护开发中
 * 08/28 19:15 魔法光灵守护基本开发完成，贴图未添加，未测试；预计为有范围的魔法添加范围指示器
 * 08/29 19:39 魔法弹的运动系统仍需调校
 * 08/31 03:31 完成并测试了魔法光灵守护；魔法弹的运动系统基本修改完毕；范围指示器未添加
 * 08/31 15:21 添加并规范化了范围指示器的实现
 * 08/31 17:33 计划添加魔法重生女神之礼赞
 * 09/01 04:02 魔法重生女神之礼赞开发中
 * 09/01 18:22 完成了魔法重生女神之礼赞
 * 09/01 22:01 为魔力输出添加了按魔法种类细分的条目
 * 09/02 03:57 添加了发展能力治愈，效果未测试
 * 09/02 14:40 完成了发展能力治愈，修改了部分发展能力的文本
 */